dchithinh/stm32f407xx_pomodoro/bsp/lcd/lcd.c
/* The original code is took from : https://github.com/niekiran/EmbeddedGraphicsLVGL-MCU3/tree/main/Projects
 * The modified code is my learning and hands-on experience with STM32F407xx and LCD.
 * 
 * DMA Implementation Notes:
 * ========================
 * This driver supports high-performance LCD flushing using DMA in interrupt mode.
 * 
 * DMA Configuration:
 * - DMA1 Stream 4, Channel 0 (SPI2_TX)
 * - 16-bit transfers for RGB565 pixel format
 * - Interrupt-driven (non-blocking) operation
 * - NVIC Priority: 5 (lower than critical system interrupts)
 * 
 * Operation Flow:
 * 1. lcd_flush() prepares display area and initiates DMA transfer
 * 2. lcd_write_dma() switches SPI to 16-bit mode and starts DMA
 * 3. CPU is free to execute other tasks (LVGL, touch, Pomodoro logic)
 * 4. HAL_SPI_TxCpltCallback() is called when DMA completes:
 *    - De-asserts CS
 *    - Restores SPI to 8-bit mode
 *    - Clears buff_to_flush flag
 * 
 * Buffer Management:
 * - Double buffering: db (draw_buffer1) and wb (draw_buffer2)
 * - buff_to_draw: Currently being filled by application
 * - buff_to_flush: Currently being transferred via DMA
 * - Atomic flag checking prevents buffer corruption
 * 
 * Error Handling:
 * - HAL_SPI_ErrorCallback() handles DMA errors gracefully
 * - Aborts failed transfers and resets state
 * - Application continues without crashing
 * 
 * Performance Impact:
 * - 240x320 RGB565 framebuffer = 153,600 bytes
 * - Transfer time: ~3.7ms @ 42 MHz SPI clock
 * - CPU savings: ~95% compared to blocking mode
 * - Enables smoother UI and better touch responsiveness
 * 
 * To disable DMA (for debugging):
 * Set USE_DMA_FLUSH_LCD to 0 in bsp/lcd/config.h
*/


#include "stm32f4xx_hal.h"
#include "stm32f407xx.h"
#include "stm32f4xx_hal_rcc.h"
#include "stm32f4xx_hal_rcc_ex.h"
#include "stm32f4xx_hal_dma.h"
#include "lcd.h"
#include "hw_def.h"
#include "ili9341_reg.h"
#include "lvgl/lvgl.h"  // For LV_LOG_* macros

#if USE_DMA_FLUSH_LCD
#include "tft.h"  // For tft_dma_transfer_complete() callback
#endif


#define SET_SPI_16BIT_MODE(hspi) do { \
    (hspi)->Instance->CR1 |= SPI_CR1_DFF; \
} while(0)

#define SET_SPI_8BIT_MODE(hspi) do { \
    (hspi)->Instance->CR1 &= ~SPI_CR1_DFF; \
} while(0)


#define TRUE 1
#define FALSE 0

#define MADCTL_MY 0x80  ///< Bottom to top
#define MADCTL_MX 0x40  ///< Right to left
#define MADCTL_MV 0x20  ///< Reverse Mode
#define MADCTL_ML 0x10  ///< LCD refresh Bottom to top
#define MADCTL_RGB 0x00 ///< Red-Green-Blue pixel order
#define MADCTL_BGR 0x08 ///< Blue-Green-Red pixel order
#define MADCTL_MH 0x04  ///< LCD refresh right to left

SPI_HandleTypeDef lcd_spi_handle;
DMA_HandleTypeDef lcd_dma_handle;

lcd_handle_t lcd_handle;
lcd_handle_t *hlcd = &lcd_handle;


#define LCD_CS_LOW()    HAL_GPIO_WritePin(LCD_CS_PORT, LCD_CS_PIN, GPIO_PIN_RESET)
#define LCD_CS_HIGH()   HAL_GPIO_WritePin(LCD_CS_PORT, LCD_CS_PIN, GPIO_PIN_SET)
#define LCD_RESX_LOW()  HAL_GPIO_WritePin(LCD_RESX_PORT, LCD_RESX_PIN, GPIO_PIN_RESET)
#define LCD_RESX_HIGH() HAL_GPIO_WritePin(LCD_RESX_PORT, LCD_RESX_PIN, GPIO_PIN_SET)
#define LCD_DCX_LOW()   HAL_GPIO_WritePin(LCD_DCX_PORT, LCD_DCX_PIN, GPIO_PIN_RESET)
#define LCD_DCX_HIGH()  HAL_GPIO_WritePin(LCD_DCX_PORT, LCD_DCX_PIN, GPIO_PIN_SET)


// Increased buffer to 24KB each (12,288 pixels = ~51 lines)
// Trade-off: Reduced LV_MEM_SIZE from 48KB → 40KB to free 8KB RAM
#define DB_SIZE 	(24UL * 1024UL)
uint8_t db[DB_SIZE];
uint8_t wb[DB_SIZE];

static void lcd_pin_init(void);
static void lcd_spi_init(void);

static void lcd_spi_enable(void);
static void lcd_reset(void);
static void lcd_write_command(uint8_t cmd);
static void lcd_write_data(uint8_t *buffer, uint32_t length);
static void lcd_config();
static void lcd_buffer_init(lcd_handle_t *lcd);
static void lcd_set_orientation(uint8_t orientation);
#if USE_DMA_FLUSH_LCD
static void lcd_dma_init(void);
static void lcd_write_dma(uint8_t *buffer, uint32_t length);
#else
void lcd_write(uint8_t *buffer, uint32_t length);
#endif

/* Utils functions*/
static uint32_t copy_to_draw_buffer(lcd_handle_t *hlcd,uint32_t nbytes,uint32_t rgb888);
static uint32_t pixels_to_bytes(uint32_t pixels, uint8_t pixel_format);
static uint32_t bytes_to_pixels(uint32_t nbytes, uint8_t pixel_format);
static uint8_t *get_buff(lcd_handle_t *hlcd);
static void make_area(lcd_area_t *area,uint32_t x_start, uint32_t x_width,uint32_t y_start,uint32_t y_height);
static uint32_t get_total_bytes(lcd_handle_t *hlcd,uint32_t w , uint32_t h);
static uint16_t convert_rgb888_to_rgb565(uint32_t rgb888);
static void lcd_flush(lcd_handle_t *hlcd);
static uint8_t is_lcd_write_allowed(lcd_handle_t *hlcd);

void lcd_init(void)
{
    lcd_pin_init();
    lcd_spi_init();
    lcd_spi_enable();
#if USE_DMA_FLUSH_LCD
	lcd_dma_init();
	LV_LOG_USER("========================================");
	LV_LOG_USER("  LCD DRIVER: DMA MODE ACTIVE");
	LV_LOG_USER("  DMA1 Stream4, SPI2_TX, 16-bit");
	LV_LOG_USER("========================================");
#else
	LV_LOG_USER("========================================");
	LV_LOG_USER("  LCD DRIVER: BLOCKING MODE");
	LV_LOG_USER("========================================");
#endif

    lcd_reset();
    lcd_config();

    hlcd->display_area.x1 = 0;
	hlcd->display_area.x2 = LCD_ACTIVE_WIDTH - 1;
	hlcd->display_area.y1 = 0;
	hlcd->display_area.y2 = LCD_ACTIVE_HEIGHT - 1;
	hlcd->orientation = LCD_ORIENTATION;
	hlcd->pixel_format = LCD_PIXEL_FORMAT;

	uint16_t x1 = hlcd->display_area.x1;
	uint16_t x2 = hlcd->display_area.x2;
	uint16_t y1 = hlcd->display_area.y1;
	uint16_t y2 = hlcd->display_area.y2;
	lcd_set_orientation(hlcd->orientation);
	lcd_set_display_area(x1, x2, y1, y2);
	
	lcd_buffer_init(hlcd);
}

void lcd_pin_init(void)
{
    GPIO_InitTypeDef GPIO_InitStruct = {0};

    /* GPIO Ports Clock Enable */
    __HAL_RCC_GPIOB_CLK_ENABLE();
    __HAL_RCC_GPIOC_CLK_ENABLE();
    __HAL_RCC_GPIOD_CLK_ENABLE();

    GPIO_InitStruct.Pin = LCD_CS_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(LCD_CS_PORT, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = LCD_RESX_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(LCD_RESX_PORT, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = LCD_DCX_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(LCD_DCX_PORT, &GPIO_InitStruct);

