dchithinh/stm32f407xx_pomodoro/bsp/lcd/lcd.c
    GPIO_InitStruct.Pin = LCD_SCLK_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF5_SPI2;
    HAL_GPIO_Init(LCD_SCLK_PORT, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = LCD_MOSI_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF5_SPI2;
    HAL_GPIO_Init(LCD_MOSI_PORT, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = LCD_MISO_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF5_SPI2;
    HAL_GPIO_Init(LCD_MISO_PORT, &GPIO_InitStruct);

    // Set all pins to High initially
    LCD_CS_HIGH();
    LCD_RESX_HIGH();
    LCD_DCX_HIGH();
}

static void lcd_spi_init(void)
{
    __HAL_RCC_SPI2_CLK_ENABLE();

    lcd_spi_handle.Instance = LCD_SPI;
    lcd_spi_handle.Init.Mode = SPI_MODE_MASTER;
    lcd_spi_handle.Init.Direction = SPI_DIRECTION_2LINES;
    lcd_spi_handle.Init.DataSize = SPI_DATASIZE_8BIT;
    lcd_spi_handle.Init.CLKPolarity = SPI_POLARITY_LOW;
    lcd_spi_handle.Init.CLKPhase = SPI_PHASE_1EDGE;
    lcd_spi_handle.Init.NSS = SPI_NSS_SOFT;
    lcd_spi_handle.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_2;
    lcd_spi_handle.Init.FirstBit = SPI_FIRSTBIT_MSB;
    lcd_spi_handle.Init.TIMode = SPI_TIMODE_DISABLE;

    if (HAL_SPI_Init(&lcd_spi_handle) != HAL_OK)
    {
        // Initialization Error
        LV_LOG_ERROR("LCD SPI init failed");
        while(1);
    }    
}

static void lcd_spi_enable(void)
{
    __HAL_SPI_ENABLE(&lcd_spi_handle);
}

#if USE_DMA_FLUSH_LCD
static void lcd_dma_init(void)
{
	/* Enable DMA1 clock */
	__HAL_RCC_DMA1_CLK_ENABLE();

	/* Configure DMA1 Stream4 for SPI2_TX */
    lcd_dma_handle.Instance = DMA1_Stream4;
    lcd_dma_handle.Init.Channel = DMA_CHANNEL_0;
    lcd_dma_handle.Init.Direction = DMA_MEMORY_TO_PERIPH;
    lcd_dma_handle.Init.PeriphInc = DMA_PINC_DISABLE;
    lcd_dma_handle.Init.MemInc = DMA_MINC_ENABLE;
    lcd_dma_handle.Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;  // 16-bit for RGB565
    lcd_dma_handle.Init.MemDataAlignment = DMA_MDATAALIGN_HALFWORD;    // 16-bit for RGB565
    lcd_dma_handle.Init.Mode = DMA_NORMAL;                              // Single shot transfer
    lcd_dma_handle.Init.Priority = DMA_PRIORITY_HIGH;
    lcd_dma_handle.Init.FIFOMode = DMA_FIFOMODE_DISABLE;                // Direct mode
    
    if (HAL_DMA_Init(&lcd_dma_handle) != HAL_OK)
    {
		LV_LOG_ERROR("LCD DMA init failed");
		while(1);
    }

	/* Link DMA handle to SPI handle */
    __HAL_LINKDMA(&lcd_spi_handle, hdmatx, lcd_dma_handle);

	/* Configure NVIC for DMA interrupt */
	HAL_NVIC_SetPriority(DMA1_Stream4_IRQn, 5, 0);  // Lower priority than critical interrupts
	HAL_NVIC_EnableIRQ(DMA1_Stream4_IRQn);

	LV_LOG_USER("LCD DMA initialized successfully");
}
#endif // USE_DMA_FLUSH_LCD

static void lcd_reset(void)
{
    LCD_RESX_LOW();
    HAL_Delay(50); // Wait for 50 ms
    LCD_RESX_HIGH();
    HAL_Delay(50); // Wait for 50 ms


}


static void lcd_write_command(uint8_t cmd)
{
#ifndef USE_STM32_API
	SPI_TypeDef *pSPI = LCD_SPI;
#endif
    LCD_CS_LOW();
    LCD_DCX_LOW(); // Command mode
	
	/*When using STM32 API, the config failed and LCD can't display correct color*/

#if USE_STM32_API
    HAL_SPI_Transmit(&lcd_spi_handle, &cmd, 1, HAL_MAX_DELAY);
	
#else
	while (!(pSPI->SR & SPI_SR_TXE));
    pSPI->DR = cmd;
    while (!(pSPI->SR & SPI_SR_TXE));
    while (pSPI->SR & SPI_SR_BSY);
#endif

    LCD_DCX_HIGH(); //Back to default state
    LCD_CS_HIGH();
}

static void lcd_write_data(uint8_t *buffer, uint32_t length)
{
#ifndef USE_STM32_API
	SPI_TypeDef *pSPI = LCD_SPI;
#endif

    LCD_DCX_HIGH(); // Data mode
	LCD_CS_LOW();
	
	/*When using STM32 API, the config failed and LCD can't display correct color*/
#if USE_STM32_API
    HAL_SPI_Transmit(&lcd_spi_handle, buffer, length, HAL_MAX_DELAY);
#else
	for (uint32_t i = 0; i < length; i++) {
        while (!(pSPI->SR & SPI_SR_TXE));      // Wait until TX buffer is empty
        pSPI->DR = buffer[i];                  // Send byte
    }
    while (!(pSPI->SR & SPI_SR_TXE));          // Ensure last byte moved to shift register
    while (pSPI->SR & SPI_SR_BSY);             // Wait until SPI is not busy
#endif

    LCD_CS_HIGH();
}

static void lcd_config(void)
{
     uint8_t params[15];
	lcd_write_command(ILI9341_SWRESET);
	lcd_write_command(ILI9341_POWERB);
	params[0] = 0x00;
	params[1] = 0xD9;
	params[2] = 0x30;
	lcd_write_data(params, 3);

	lcd_write_command(ILI9341_POWER_SEQ);
	params[0]= 0x64;
	params[1]= 0x03;
	params[2]= 0X12;
	params[3]= 0X81;
	lcd_write_data(params, 4);

	lcd_write_command(ILI9341_DTCA);
	params[0]= 0x85;
	params[1]= 0x10;
	params[2]= 0x7A;
	lcd_write_data(params, 3);

	lcd_write_command(ILI9341_POWERA);
	params[0]= 0x39;
	params[1]= 0x2C;
	params[2]= 0x00;
	params[3]= 0x34;
	params[4]= 0x02;
	lcd_write_data(params, 5);

	lcd_write_command(ILI9341_PRC);
	params[0]= 0x20;
	lcd_write_data(params, 1);

	lcd_write_command(ILI9341_DTCB);
	params[0]= 0x00;
	params[1]= 0x00;
	lcd_write_data(params, 2);

	lcd_write_command(ILI9341_POWER1);
	params[0]= 0x1B;
	lcd_write_data(params, 1);

	lcd_write_command(ILI9341_POWER2);
	params[0]= 0x12;
	lcd_write_data(params, 1);

	lcd_write_command(ILI9341_VCOM1);
	params[0]= 0x08;
	params[1]= 0x26;
	lcd_write_data(params, 2);

	lcd_write_command(ILI9341_VCOM2);
	params[0]= 0XB7;
	lcd_write_data(params, 1);


	lcd_write_command(ILI9341_PIXEL_FORMAT);
	params[0]= 0x55; //select RGB565
	lcd_write_data(params, 1);

	lcd_write_command(ILI9341_FRMCTR1);
	params[0]= 0x00;
	params[1]= 0x1B;//frame rate = 70
	lcd_write_data(params, 2);

	lcd_write_command(ILI9341_DFC);    // Display Function Control
	params[0]= 0x0A;
	params[1]= 0xA2;
	lcd_write_data(params, 2);

	lcd_write_command(ILI9341_3GAMMA_EN);    // 3Gamma Function Disable
	params[0]= 0x02; //LCD_WR_DATA(0x00);
	lcd_write_data(params, 1);

	lcd_write_command(ILI9341_GAMMA);
	params[0]= 0x01;
	lcd_write_data(params, 1);

	lcd_write_command(ILI9341_PGAMMA);    //Set Gamma
	params[0]= 0x0F;
	params[1]= 0x1D;
	params[2]= 0x1A;
	params[3]= 0x0A;
	params[4]= 0x0D;
	params[5]= 0x07;
	params[6]= 0x49;
	params[7]= 0X66;
	params[8]= 0x3B;
	params[9]= 0x07;
	params[10]= 0x11;
	params[11]= 0x01;
	params[12]= 0x09;
	params[13]= 0x05;
	params[14]= 0x04;
	lcd_write_data(params, 15);

	lcd_write_command(ILI9341_NGAMMA);
	params[0]= 0x00;
	params[1]= 0x18;
	params[2]= 0x1D;
	params[3]= 0x02;
	params[4]= 0x0F;
	params[5]= 0x04;
	params[6]= 0x36;
	params[7]= 0x13;
	params[8]= 0x4C;
	params[9]= 0x07;
	params[10]= 0x13;
	params[11]= 0x0F;
	params[12]= 0x2E;
	params[13]= 0x2F;
	params[14]= 0x05;
	lcd_write_data(params, 15);

	lcd_write_command(ILI9341_SLEEP_OUT); //Exit Sleep
	HAL_Delay(50); // Wait for 50 ms
	HAL_Delay(50); // Wait for 50 ms
	lcd_write_command(ILI9341_DISPLAY_ON); //display on
}



void lcd_set_background_color(uint32_t rgb888)
{
    lcd_fill_rect(rgb888, 0, (LCD_ACTIVE_WIDTH), 0, (LCD_ACTIVE_HEIGHT));
}

void lcd_fill_rect(uint32_t rgb888, uint32_t x_start, uint32_t x_width, uint32_t y_start,uint32_t y_height)
{
    uint32_t total_bytes_to_write = 0;
	uint32_t bytes_sent_so_far = 0;
	uint32_t remaining_bytes = 0;;
	uint32_t npix;
	uint32_t pixels_sent = 0;
	uint32_t x1,y1;
	uint32_t pixel_per_line = x_width;

	if((x_start+x_width) > LCD_ACTIVE_WIDTH) return;
	if((y_start+y_height) > LCD_ACTIVE_HEIGHT) return;

	//1. calculate total number of bytes written in to DB
	total_bytes_to_write = get_total_bytes(hlcd,x_width,y_height);
	remaining_bytes = total_bytes_to_write;
	while(remaining_bytes)
	{
		x1 = x_start+(pixels_sent % pixel_per_line);
		y1 = y_start+(pixels_sent / pixel_per_line);

		make_area(&hlcd->display_area,x1,x_width,y1,y_height);

