dchithinh/stm32f407xx_pomodoro/bsp/lcd/lcd.c
		if(x1 != x_start)
		{
			npix = x_start+x_width - x1;
		}
		else
		{
			npix = bytes_to_pixels(remaining_bytes,hlcd->pixel_format);
		}

		bytes_sent_so_far  +=  copy_to_draw_buffer(hlcd,pixels_to_bytes(npix,hlcd->pixel_format),rgb888);
		pixels_sent = bytes_to_pixels(bytes_sent_so_far,hlcd->pixel_format);
		remaining_bytes = total_bytes_to_write - bytes_sent_so_far;
	}
}


void lcd_set_orientation(uint8_t orientation)
{
	uint8_t param;

	if(orientation == LANDSCAPE){
		param = MADCTL_MV | MADCTL_MY | MADCTL_BGR; /*Memory Access Control <Landscape setting>*/
	}else if(orientation == PORTRAIT){
		param = MADCTL_MY | MADCTL_MX | MADCTL_RGB;  /* Memory Access Control <portrait setting> */
	}

	lcd_write_command(ILI9341_MAC);    // Memory Access Control command
	lcd_write_data(&param, 1);
}

void lcd_set_display_area(uint16_t x1, uint16_t x2, uint16_t y1, uint16_t y2)
{
	uint8_t params[4];
	//Set the column address
	params[0] = HIGH_16(x1);
	params[1] = LOW_16(x1);
	params[2] = HIGH_16(x2);
	params[3] = LOW_16(x2);
	lcd_write_command(ILI9341_CASET);
	lcd_write_data(params, 4);

	//Set the row address
	params[0] = HIGH_16(y1);
	params[1] = LOW_16(y1);
	params[2] = HIGH_16(y2);
	params[3] = LOW_16(y2);
	lcd_write_command(ILI9341_RASET);
	lcd_write_data(params, 4);
	
}

static void lcd_buffer_init(lcd_handle_t *lcd)
{
	lcd->draw_buffer1 = db;
	lcd->draw_buffer2 = wb;
	lcd->buff_to_draw = NULL;
	lcd->buff_to_flush = NULL;
}

static uint8_t is_lcd_write_allowed(lcd_handle_t *hlcd)
{
	uint8_t result;
	__disable_irq();
	result = (!hlcd->buff_to_flush) ? TRUE : FALSE;
	__enable_irq();

	return result;
}

void lcd_send_cmd_mem_write(void)
{
	lcd_write_command(ILI9341_GRAM);
}

static void lcd_flush(lcd_handle_t *hlcd)
{
	uint16_t x1 = hlcd->display_area.x1;
	uint16_t x2 = hlcd->display_area.x2;
	uint16_t y1 = hlcd->display_area.y1;
	uint16_t y2 = hlcd->display_area.y2;
	lcd_set_display_area(x1, x2, y1, y2);
	lcd_send_cmd_mem_write();

#if USE_DMA_FLUSH_LCD
	lcd_write_dma(hlcd->buff_to_flush, hlcd->write_length);
	/* Note: buff_to_flush will be cleared in HAL_SPI_TxCpltCallback after DMA completes */
#else
	lcd_write(hlcd->buff_to_flush, hlcd->write_length);
	hlcd->buff_to_flush = NULL;  /* Clear immediately in blocking mode */
#endif
}

static uint16_t convert_rgb888_to_rgb565(uint32_t rgb888)
{
    uint16_t r,g,b;
	r = (rgb888 >> 19) & 0x1FU; // (A) 1111 1111 | (R) 1111 1111 | (G) 1111 1111 | (B) 1111 1111 -> 000 0000 0000 0000 0000 1111 1111 | 1111 1
	g = (rgb888 >> 10) & 0x3FU;
	b = (rgb888 >> 3)  & 0x1FU;
	return (uint16_t)((r << 11) | (g << 5) | b);
}

static uint32_t get_total_bytes(lcd_handle_t *hlcd,uint32_t w , uint32_t h)
{
    //TODO: Add support for other pixel formats, Now just RGB565 is supported
	uint8_t bytes_per_pixel = 2;
	if(hlcd->pixel_format == LCD_PIXEL_FORMAT){
		bytes_per_pixel = 2;
	}
    else {
        LV_LOG_WARN("Unsupported pixel format: %d", hlcd->pixel_format);
    }
	return (w * h * bytes_per_pixel);
}

static void make_area(lcd_area_t *area,uint32_t x_start, uint32_t x_width,uint32_t y_start,uint32_t y_height){

	uint16_t lcd_total_width,lcd_total_height;

	lcd_total_width =  LCD_ACTIVE_WIDTH-1;
	lcd_total_height = LCD_ACTIVE_HEIGHT -1;

	area->x1 = x_start;
	area->x2 = x_start + x_width -1;
	area->y1 = y_start;
	area->y2 = y_start + y_height -1;

	area->x2 = (area->x2 > lcd_total_width) ? lcd_total_width :area->x2;
	area->y2 = (area->y2 > lcd_total_height) ? lcd_total_height : area->y2;

}

static uint8_t *get_buff(lcd_handle_t *hlcd)
{
	uint32_t buf1 = (uint32_t)hlcd->draw_buffer1;
	uint32_t buf2 = (uint32_t)hlcd->draw_buffer2;
	uint8_t *result = NULL;

	__disable_irq();
	if(hlcd->buff_to_draw == NULL && hlcd->buff_to_flush == NULL){
		result = hlcd->draw_buffer1;
	}else if((uint32_t)hlcd->buff_to_flush == buf1 && hlcd->buff_to_draw == NULL ){
		result = hlcd->draw_buffer2;
	}else if ((uint32_t)hlcd->buff_to_flush == buf2 && hlcd->buff_to_draw == NULL){
		result = hlcd->draw_buffer1;
	}
	__enable_irq();

	return result;
}

static uint32_t bytes_to_pixels(uint32_t nbytes, uint8_t pixel_format)
{
	UNUSED(pixel_format);
	return nbytes/2;

}

static uint32_t pixels_to_bytes(uint32_t pixels, uint8_t pixel_format)
{
	UNUSED(pixel_format);
	return pixels * 2UL;
}

static uint32_t copy_to_draw_buffer(lcd_handle_t *hlcd,uint32_t nbytes,uint32_t rgb888)
{
	uint16_t *fb_ptr = NULL;
	uint32_t npixels;
	
	/* Get available buffer (returns NULL if both buffers busy) */
	hlcd->buff_to_draw = get_buff(hlcd);
	
#if USE_DMA_FLUSH_LCD
	/* In DMA mode: If both buffers busy, yield briefly */
	uint32_t timeout = 0;
	while(hlcd->buff_to_draw == NULL) {
		/* Small delay to yield CPU instead of spinning at 100% */
		for(volatile uint32_t i = 0; i < 100; i++);  /* ~1us delay at 84MHz */
		hlcd->buff_to_draw = get_buff(hlcd);
		
		/* Safety timeout to prevent infinite loop */
		if(++timeout > 10000) {
			LV_LOG_ERROR("Buffer timeout!");
			break;
		}
	}
#else
	/* In blocking mode: Should never be NULL (previous transfer completes immediately) */
	if(hlcd->buff_to_draw == NULL) {
		LV_LOG_ERROR("No buffer available in blocking mode!");
		return 0;
	}
#endif
	
	fb_ptr = (uint16_t*)hlcd->buff_to_draw;
	nbytes =  ((nbytes > DB_SIZE)?DB_SIZE:nbytes);
	npixels= bytes_to_pixels(nbytes,hlcd->pixel_format);
	
	/* Fill buffer with color */
	for(uint32_t i = 0 ; i < npixels ;i++){
		*fb_ptr = convert_rgb888_to_rgb565(rgb888);
		fb_ptr++;
	}
	
	hlcd->write_length = pixels_to_bytes(npixels,hlcd->pixel_format);
	hlcd->buff_to_flush = hlcd->buff_to_draw;
	hlcd->buff_to_draw = NULL;
	lcd_flush(hlcd);
	
	return pixels_to_bytes(npixels,hlcd->pixel_format);
}

#if USE_DMA_FLUSH_LCD
static void lcd_write_dma(uint8_t *buffer, uint32_t length)
{
	HAL_StatusTypeDef status;
	
	/* Switch SPI to 16-bit mode for pixel data */
	__HAL_SPI_DISABLE(&lcd_spi_handle);
	SET_SPI_16BIT_MODE(&lcd_spi_handle);
	__HAL_SPI_ENABLE(&lcd_spi_handle);

	/* Assert chip select */
	LCD_CS_LOW();

