dchithinh/stm32f407xx_pomodoro/bsp/lcd/lcd.c
	/* Start DMA transfer in interrupt mode */
	status = HAL_SPI_Transmit_DMA(&lcd_spi_handle, buffer, length / 2);
	
	if (status != HAL_OK)
	{
		/* Fallback: restore state on error */
		LCD_CS_HIGH();
		__HAL_SPI_DISABLE(&lcd_spi_handle);
		SET_SPI_8BIT_MODE(&lcd_spi_handle);
		__HAL_SPI_ENABLE(&lcd_spi_handle);
		
		/* Clear buffer state */
		hlcd->buff_to_flush = NULL;
	}
}
#endif // USE_DMA_FLUSH_LCD

/* Unified API for writing pixels - works in both DMA and non-DMA modes */
void lcd_write_pixels(uint8_t *buffer, uint32_t length)
{
#if USE_DMA_FLUSH_LCD
	lcd_write_dma(buffer, length);
#else
    // Switch SPI to 16-bit mode
    __HAL_SPI_DISABLE(&lcd_spi_handle);
    SET_SPI_16BIT_MODE(&lcd_spi_handle);
    __HAL_SPI_ENABLE(&lcd_spi_handle);

    LCD_CS_LOW();

    uint16_t *data_ptr = (uint16_t *)buffer;
    uint32_t count = length / 2;   // number of 16-bit words

    for(uint32_t i = 0; i < count; i++) {
        // Wait until TX buffer empty
        while(!(lcd_spi_handle.Instance->SR & SPI_SR_TXE));

        // Write next 16-bit pixel
        lcd_spi_handle.Instance->DR = *data_ptr++;
    }

    // Wait for last transmission to fully complete
    while(!(lcd_spi_handle.Instance->SR & SPI_SR_TXE));
    while(lcd_spi_handle.Instance->SR & SPI_SR_BSY);

    LCD_CS_HIGH();

    // Restore back to 8-bit mode
    __HAL_SPI_DISABLE(&lcd_spi_handle);
    SET_SPI_8BIT_MODE(&lcd_spi_handle);
    __HAL_SPI_ENABLE(&lcd_spi_handle);
#endif
}

void ili9341_test_draw_color_bars(void)
{
    // === Set Column Address (0 to 239) ===
    lcd_write_command(0x2A);
    uint8_t col_data[4] = { 0x00, 0x00, 0x00, 0xEF };  // 0 to 239 (0xEF)
    lcd_write_data(col_data, 4);

    // === Set Page Address (0 to 319) ===
    lcd_write_command(0x2B);
    uint8_t row_data[4] = { 0x00, 0x00, 0x01, 0x3F };  // 0 to 319 (0x13F)
    lcd_write_data(row_data, 4);

    // === Write Memory Command ===
    lcd_write_command(0x2C);

    // Prepare color lines (80 pixels each)
    uint8_t red_line[80 * 2];
    uint8_t green_line[80 * 2];
    uint8_t blue_line[80 * 2];

    for (int i = 0; i < 80; i++) {
        // Red (RGB565: 0xF800)
        red_line[2 * i]     = 0xF8;
        red_line[2 * i + 1] = 0x00;

        // Green (RGB565: 0x07E0)
        green_line[2 * i]     = 0x07;
        green_line[2 * i + 1] = 0xE0;

        // Blue (RGB565: 0x001F)
        blue_line[2 * i]     = 0x00;
        blue_line[2 * i + 1] = 0x1F;
    }

    // === Draw 320 lines (rows) ===
    LCD_DCX_HIGH(); // Data mode
    LCD_CS_LOW();

    for (int y = 0; y < 320; y++) {
        HAL_SPI_Transmit(&lcd_spi_handle, red_line, sizeof(red_line), HAL_MAX_DELAY);
        HAL_SPI_Transmit(&lcd_spi_handle, green_line, sizeof(green_line), HAL_MAX_DELAY);
        HAL_SPI_Transmit(&lcd_spi_handle, blue_line, sizeof(blue_line), HAL_MAX_DELAY);
    }

    LCD_CS_HIGH();
}

void HAL_SPI_TxCpltCallback(SPI_HandleTypeDef *hspi)
{
	/* Verify this is our SPI peripheral */
	if (hspi->Instance != LCD_SPI)
		return;
	
	/* De-assert chip select */
	LCD_CS_HIGH();

	/* Restore SPI to 8-bit mode for commands */
	__HAL_SPI_DISABLE(hspi);
	SET_SPI_8BIT_MODE(hspi);
	__HAL_SPI_ENABLE(hspi);

	/* Clear buffer flush flag - buffer is now free */
	if (hlcd != NULL)
		hlcd->buff_to_flush = NULL;

#if USE_DMA_FLUSH_LCD
	/* Notify LVGL that flush is complete */
	tft_dma_transfer_complete();
#endif
}

void HAL_SPI_ErrorCallback(SPI_HandleTypeDef *hspi)
{
	/* Verify this is our SPI peripheral */
	if (hspi->Instance != LCD_SPI)
		return;
	
	/* De-assert chip select */
	LCD_CS_HIGH();
	
	/* Abort DMA transfer */
	if (hspi->hdmatx != NULL)
		HAL_DMA_Abort(hspi->hdmatx);
	
	/* Restore SPI to 8-bit mode */
	__HAL_SPI_DISABLE(hspi);
	SET_SPI_8BIT_MODE(hspi);
	__HAL_SPI_ENABLE(hspi);
	
	/* Clear buffer state to allow recovery */
	if (hlcd != NULL) {
		hlcd->buff_to_flush = NULL;
		hlcd->buff_to_draw = NULL;
	}
	
#if USE_DMA_FLUSH_LCD
	/* Still need to notify LVGL even on error */
	tft_dma_transfer_complete();
#endif
}

void HAL_SPI_TxHalfCpltCallback(SPI_HandleTypeDef *hspi)
{
	// Handle half transfer complete here if needed
	// This is optional and can be used for debugging or other purposes
}

void *lcd_get_draw_buffer1_addr(void)
{
    return (void*)hlcd->draw_buffer1;
}
void *lcd_get_draw_buffer2_addr(void)
{
	return (void*)hlcd->draw_buffer2;
}
